<?php
define("BASE_URL", "http://talivo.local/");
?>
<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
    <link rel="stylesheet" href="<?= BASE_URL ?>css/main.css">
    <link rel="stylesheet" href="<?= BASE_URL ?>css/Chat.css">

</head>

<body>
    <header>
        <div class="container">
            <div class="flex">
                <div class="map">
                    Гомель
                </div>
                <div class="del">
                    <ul>
                        <?php if (isset($_SESSION['role']) && $_SESSION['role'] === 'user'): ?>
                            <!-- Обычный пользователь -->

                            <li>
                                <a href="#">Заказать услугу</a>
                            </li>
                        <?php elseif (isset($_SESSION['role']) && $_SESSION['role'] === 'seller'): ?>
                            <!-- Продавец -->
                            <li>
                                <a href="<?= BASE_URL ?>php/Post/createPost.php">Создать объявление</a>
                            </li>
                            <li>
                                <a href="<?= BASE_URL ?>php/seller/accountSeller.php">
                                    <?= isset($_SESSION['name']) ? htmlspecialchars($_SESSION['name']) : '' ?>
                                </a>
                            </li>
                        <?php else: ?>
                            <!-- Гость -->
                            <li>
                                <a href="<?= BASE_URL ?>php/seller/accountSeller.php">Стать продавцом</a>
                            </li>
                        <?php endif; ?>
                    </ul>

                </div>
            </div>
            <div class="header">
                <div class="logo">
                    <a href="<?= BASE_URL ?>index.php">
                        <img src="" alt="">
                        LOGO
                    </a>
                    <span class="burger">
                        <span class="line"></span>
                        <span class="line"></span>
                        <span class="line"></span>
                    </span>
                </div>
                <div class="search">
                    <input type="search" placeholder="Найти товар">
                    <button class="btn_search">Найти</button>
                </div>
                <nav class="nav">
                    <ul class="nav_list">
                        <?php if (isset($_SESSION['role']) && $_SESSION['role'] === 'user'): ?>

                            <li class="list_item">
                                <a href="<?= BASE_URL ?>php/user/account.php">
                                    <?= isset($_SESSION['username']) ? htmlspecialchars($_SESSION['username']) : '' ?>
                                </a>
                            </li>
                            <li class="list_item">
                                <a href="<?= BASE_URL ?>php/message/Chat.php"><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_18_67)">
                                            <path d="M11.6667 30.5003C13.2323 30.5003 14.4998 31.7678 14.4998 33.3333C14.4998 34.8989 13.2323 36.1663 11.6667 36.1663C10.1045 36.1663 8.85034 34.9021 8.85034 33.3333C8.85034 31.7645 10.1045 30.5003 11.6667 30.5003ZM28.3337 30.5003C29.8991 30.5005 31.1667 31.7679 31.1667 33.3333C31.1667 34.8987 29.8991 36.1662 28.3337 36.1663C26.7715 36.1663 25.5164 34.9021 25.5164 33.3333C25.5164 31.7645 26.7715 30.5003 28.3337 30.5003ZM6.79272 3.83333L8.23999 6.88119L8.37573 7.16634H33.3337C33.9757 7.16652 34.4998 7.68621 34.4998 8.33333C34.4998 8.53928 34.4467 8.72842 34.3572 8.88509L34.3542 8.89193L28.3972 19.7054C27.9064 20.5803 26.9773 21.1663 25.9167 21.1663H13.2039L13.0623 21.4261L11.574 24.1351C11.513 24.2418 11.4781 24.3552 11.4646 24.4691L11.4587 24.5833L11.4626 24.6781C11.5094 25.1423 11.8974 25.5002 12.3748 25.5003H31.1667V27.8333H11.6667C10.1013 27.8333 8.83392 26.5657 8.83374 25.0003C8.83374 24.5074 8.95895 24.0478 9.17944 23.6331L11.4294 19.5492L11.5535 19.3255L11.4431 19.0941L5.4519 6.45247L5.31616 6.16634H2.16675V3.83333H6.79272Z" fill="black" stroke="black" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_18_67">
                                                <rect width="40" height="40" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg></a>
                            </li>
                            <li class="list_item">
                                <a href="#"><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_18_69)">
                                            <path d="M27.4999 5C24.5999 5 21.8166 6.35 19.9999 8.475C18.1833 6.35 15.3999 5 12.4999 5C7.35825 5 3.33325 9.025 3.33325 14.1667C3.33325 20.4583 8.99992 25.6 17.5833 33.3917L19.9999 35.5833L22.4166 33.3917C30.9999 25.6 36.6666 20.4583 36.6666 14.1667C36.6666 9.025 32.6416 5 27.4999 5ZM20.1749 30.925L19.9999 31.0833L19.8249 30.925C11.8999 23.7333 6.66659 18.9833 6.66659 14.1667C6.66659 10.8417 9.17492 8.33333 12.4999 8.33333C15.0666 8.33333 17.5666 9.99167 18.4416 12.2667H21.5499C22.4333 9.99167 24.9333 8.33333 27.4999 8.33333C30.8249 8.33333 33.3333 10.8417 33.3333 14.1667C33.3333 18.9833 28.0999 23.7333 20.1749 30.925Z" fill="black" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_18_69">
                                                <rect width="40" height="40" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg></a>
                            </li>
                        <?php elseif (isset($_SESSION['role']) && $_SESSION['role'] === 'seller'): ?>
                            <li class="list_item">
                                <a href="<?= BASE_URL ?>php/message/ChatSeller.php"><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_18_67)">
                                            <path d="M11.6667 30.5003C13.2323 30.5003 14.4998 31.7678 14.4998 33.3333C14.4998 34.8989 13.2323 36.1663 11.6667 36.1663C10.1045 36.1663 8.85034 34.9021 8.85034 33.3333C8.85034 31.7645 10.1045 30.5003 11.6667 30.5003ZM28.3337 30.5003C29.8991 30.5005 31.1667 31.7679 31.1667 33.3333C31.1667 34.8987 29.8991 36.1662 28.3337 36.1663C26.7715 36.1663 25.5164 34.9021 25.5164 33.3333C25.5164 31.7645 26.7715 30.5003 28.3337 30.5003ZM6.79272 3.83333L8.23999 6.88119L8.37573 7.16634H33.3337C33.9757 7.16652 34.4998 7.68621 34.4998 8.33333C34.4998 8.53928 34.4467 8.72842 34.3572 8.88509L34.3542 8.89193L28.3972 19.7054C27.9064 20.5803 26.9773 21.1663 25.9167 21.1663H13.2039L13.0623 21.4261L11.574 24.1351C11.513 24.2418 11.4781 24.3552 11.4646 24.4691L11.4587 24.5833L11.4626 24.6781C11.5094 25.1423 11.8974 25.5002 12.3748 25.5003H31.1667V27.8333H11.6667C10.1013 27.8333 8.83392 26.5657 8.83374 25.0003C8.83374 24.5074 8.95895 24.0478 9.17944 23.6331L11.4294 19.5492L11.5535 19.3255L11.4431 19.0941L5.4519 6.45247L5.31616 6.16634H2.16675V3.83333H6.79272Z" fill="black" stroke="black" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_18_67">
                                                <rect width="40" height="40" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg></a>
                            </li>
                            <li class="list_item">
                                <a href="#"><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_18_69)">
                                            <path d="M27.4999 5C24.5999 5 21.8166 6.35 19.9999 8.475C18.1833 6.35 15.3999 5 12.4999 5C7.35825 5 3.33325 9.025 3.33325 14.1667C3.33325 20.4583 8.99992 25.6 17.5833 33.3917L19.9999 35.5833L22.4166 33.3917C30.9999 25.6 36.6666 20.4583 36.6666 14.1667C36.6666 9.025 32.6416 5 27.4999 5ZM20.1749 30.925L19.9999 31.0833L19.8249 30.925C11.8999 23.7333 6.66659 18.9833 6.66659 14.1667C6.66659 10.8417 9.17492 8.33333 12.4999 8.33333C15.0666 8.33333 17.5666 9.99167 18.4416 12.2667H21.5499C22.4333 9.99167 24.9333 8.33333 27.4999 8.33333C30.8249 8.33333 33.3333 10.8417 33.3333 14.1667C33.3333 18.9833 28.0999 23.7333 20.1749 30.925Z" fill="black" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_18_69">
                                                <rect width="40" height="40" fill="white" />
                                            </clipPath>
                                        </defs>
                                    </svg></a>
                            </li>
                        <?php else: ?>
                            <li class="list_item">
                                <a href="<?= BASE_URL ?>php/user/account.php">
                                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M20 21.25C14.7166 21.25 10.4166 16.95 10.4166 11.6667C10.4166 6.38333 14.7166 2.08333 20 2.08333C25.2833 2.08333 29.5833 6.38333 29.5833 11.6667C29.5833 16.95 25.2833 21.25 20 21.25ZM20 4.58333C16.1 4.58333 12.9166 7.76667 12.9166 11.6667C12.9166 15.5667 16.1 18.75 20 18.75C23.9 18.75 27.0833 15.5667 27.0833 11.6667C27.0833 7.76667 23.9 4.58333 20 4.58333Z" fill="#292D32" />
                                        <path d="M34.3169 37.9167C33.6336 37.9167 33.0669 37.35 33.0669 36.6667C33.0669 30.9167 27.2003 26.25 20.0003 26.25C12.8003 26.25 6.93359 30.9167 6.93359 36.6667C6.93359 37.35 6.36693 37.9167 5.68359 37.9167C5.00026 37.9167 4.43359 37.35 4.43359 36.6667C4.43359 29.55 11.4169 23.75 20.0003 23.75C28.5836 23.75 35.5669 29.55 35.5669 36.6667C35.5669 37.35 35.0002 37.9167 34.3169 37.9167Z" fill="#292D32" />
                                    </svg>
                                </a>
                            </li>
                        <?php endif; ?>
                    </ul>
                </nav>
            </div>
        </div>
    </header>